In [53]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [54]:
df = pd.DataFrame({'qtd':[150, 50, 25, 25, 75, 50], 'forma': ['caminhando', 'bus', 'metro', 'carro', 'bike', 'moto']})

In [55]:
df

   qtd       forma
0  150  caminhando
1   50         bus
2   25       metro
3   25       carro
4   75        bike
5   50        moto

In [57]:
contagem = df.groupby(by = 'qtd').count()
contagem

     forma
qtd
25       2
50       2
75       1
150      1

In [60]:
print(df)

   qtd       forma
0  150  caminhando
1   50         bus
2   25       metro
3   25       carro
4   75        bike
5   50        moto

In [62]:
print(df.iloc[0])

qtd             150
forma    caminhando
Name: 0, dtype: object

In [66]:
print(df.iloc[1:].sum())

qtd                        225
forma    busmetrocarrobikemoto
dtype: object